---
kind: method
id: M:Autodesk.Revit.DB.HermiteSurface.IsValid
source: html/bcd3ba1e-de42-cca3-3815-4c8f41c690a4.htm
---
# Autodesk.Revit.DB.HermiteSurface.IsValid Method

Checks whether this HermiteSurface object is valid.

## Syntax (C#)
```csharp
public bool IsValid()
```

## Returns
True if this is a valid Hermite Surface, false otherwise.

## Remarks
An attempt to access or compute data in an invalid Hermite Surface will cause an exception.